<?php

return [
    'text' => [
        'start' => "Расскажите нам о багах или замечаниях. Если необходимо, прикрепите файлы (обязательно как документы, без сжатия).",
        'prepared' => "Мы подготовили отчет для команды разработки:\n\n<i>:message</i>\n\nПрикрепленные файлы:\n<i>:files</i>",
        'need_text' => "Необходимо ввести текст, описывающий проблему",
        'files_empty' => "Нет файлов",
        'sent' => "Спасибо за обратную связь!",
    ],
    'buttons' => [
        'back' => "Назад",
        'cancel' => "Отменить",
        'send' => "Отправить",
    ],
];
