<?php

return [
    'spam' => 'Не стоит отправлять так много сообщений. Возьму перерыв...',
    'home' => [
        'text' => 'Привет. Основные функции:',
    ],
    'language' => [
        'text' => 'Выберите язык',
    ],
    'rules' => [
        'text' => 'Правила. Согласны?',
    ],
    'token_scanner' => [
        'text' => 'Введи',
        'pending' => 'Отчет будет отправлен вам сообщением, как только будет готов',
    ],
    'buttons' => [
        'ru' => '🇷🇺 Русский',
        'en' => '🇺🇸 English',
        'back' => 'Назад',
        'agree' => 'Согласен',
        'token_scanner' => '🔎 Token Scanner',
        'wallet_tracker' => '👀 Wallet Tracker',
        'black_box' => '🗃 Black Box',
        'check_wallet' => '🚨 Check My Wallet',
        'academy' => '📚 The Academy',
        'gpt' => '💡 GPTo',
        'profile' => '⚙️ Профиль',
    ],
];
